Show / Hide Table of Contents
Class LoadGroupEC
Load group for EC
Inheritance
System.Object
OpenObject
OpenElementId
LoadGroup
LoadGroupEC
Inherited Members
 LoadGroup.Name
 LoadGroup.Relation
 LoadGroup.GroupType
 LoadGroup.GammaQ
 LoadGroup.Dzeta
 LoadGroup.GammaGInf
 LoadGroup.GammaGSup
 OpenElementId.Id
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Loading
Assembly: IdeaRS.OpenModel.dll
Syntax
[OpenModelClass("CI.StructModel.Loading.LoadGroupEC,CI.Loading", "CI.StructModel.Loading.ILoadGroup,CI.BasicTypes", typeof(LoadGroup))]
public class LoadGroupEC : LoadGroup
Examples
This sample shows how to create a load group.
//Creating the model
OpenModel openModel = new OpenModel();
//Load group - needed for Load case
LoadGroupEC loadGroup = new LoadGroupEC();
loadGroup.Name = "LG1";
loadGroup.GammaQ = 1.5;
loadGroup.Psi0 = 0.7;
loadGroup.Psi1 = 0.5;
loadGroup.Psi2 = 0.3;
loadGroup.GammaGInf = 1.0;
loadGroup.GammaGSup = 1.35;
loadGroup.Dzeta = 0.85;
openModel.AddObject(loadGroup);
Constructors
Improve this Doc   View Source
LoadGroupEC()
Constructor
Declaration
public LoadGroupEC()
Properties
Improve this Doc   View Source
Psi0
ψ 0
Declaration
public double Psi0 { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
Psi1
ψ 1
Declaration
public double Psi1 { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
Psi2
ψ 2
Declaration
public double Psi2 { get; set; }
Property Value
 Type |  Description
 System.Double
 Improve this Doc
 View Source